# Задание-1:
# Напишите функцию, округляющую полученное произвольное десятичное число
# до кол-ва знаков (кол-во знаков передается вторым аргументом).
# Округление должно происходить по математическим правилам (0.6 --> 1, 0.4 --> 0).
# Для решения задачи не используйте встроенные функции и функции из модуля math.


def my_round(number, ndigits):
    return int(number * 10 ** ndigits + 0.5) / 10 ** ndigits


print(my_round(2.1234567, 6))
print(my_round(2.1999967, 5))
print(my_round(2.9999967, 3))
print(my_round(2.1233444, 3))

# Задание-2:
# Дан шестизначный номер билета. Определить, является ли билет счастливым.
# Решение реализовать в виде функции.
# Билет считается счастливым, если сумма его первых и последних цифр равны.
# !!!P.S.: функция не должна НИЧЕГО print'ить

print('\n' * 2)
print(f'{"*" * 15} Задание2 {"*" * 15}')


def lucky_ticket(ticket_number):
    digits = list(map(int, str(ticket_number)))

    if len(digits) == 6 and sum(digits[:3]) == sum(digits[3:]):
        return f'Билетик №{ticket_number} - счастливый! Загадайте желание!'

    return f'Видимо, не ваш день' if len(digits) == 6 else 'Даже номер билетика ввести верно не можете...'


print(lucky_ticket(123006))
print(lucky_ticket(12321))
print(lucky_ticket(436751))
